paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/lookupAuthorization.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.lookupauthorization">
   <soapenv:Header/>
   <soapenv:Body>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
     <urn:authorizationId>2DC87612EK520411B</urn:authorizationId>
     <urn:authorization>Bearer L8XmqR.Jp3ziVtzRTY0WEUfMpsE5Xw1qor2fGv51r.E</urn:authorization>
   </soapenv:Body>
</soapenv:Envelope>
